// Структуры данных
// Реализовать представленные ниже структуры  данных, включая методы работы 
//(добавление, получение, обновление, удаление) с ними и методы обхода, 
//без использования сторонних библиотек или стандартных структур данных:

// Связный список, двусвязный, кольцевой.
// Хеш-таблица.
// FIFO или LIFO.
// Сортировка
// Реализовать представленные ниже алгоритмы сортировки:

// Алгоритм устойчивой сортировки не хуже O(n*log(n)) в среднем.
// Алгоритм неустойчивой сортировки не хуже O(n*log(n)) в среднем.
// Алгоритм на выбор.
